<template>
  <div class="services_main dir-rtl">
    <div class="container">
      <div class="row">
        <div class="col-md-3">
          <div class="titlepage">
            <h2>آشا؟!!</h2>
          </div>
        </div>
        <div class="col-sm-9" id="about-us-text">
          ما، گروه مشاورهٔ آشا، تاکنون توانسته‌ایم به شرکت‌های مختلف کمک کنیم تا
          راحت‌تر و سریع‌تر گواهی‌ها و مجوزهای لازم خود را دریافت کنند. مشتریان
          ما مدیران هوشمندی هستند که تمایل دارند تمرکز آنها تنها به تولید و
          ارتقای کیفی‌ محصولاتشان معطوف باشد و از دغدغه‌های دریافت مجوزهای مختلف
          رهایی یابند. دریافت بیش از بیست گواهی دانش‌بنیان، ایزو کیفیت و مجوز
          تولید تجهیزات پزشکی در یک سال گذشته برای شرکت های بزرگ و حتی نوپا،
          تنها بخشی از فعالیت ماست. خرسندیم که این شما مشتریان عزیز هستید، که ما
          را به دیگران معرفی می‌کنید و اعتماد شما به ما، گویای توانمندی و تعهدی
          است که در ارائهٔ خدماتمان دیده‌اید.
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {};
</script>

<style>
#about-us-text {
  text-align: justify;
}
</style>